{
  "careerItems": [
    {
      "from": "2020-09-01",
      "isCurrent": true,
      "title": "Software Developer",
      "company": "InScale (Client: SEB Life & Pension)",
      "city": "Kuala Lumpur",
      "country": "Malaysia",
      "tags": [ "C#", "Blazor" ],
      "details": [
        "Implemented service (.Net Core web API) for insurance premium calculations.",
        "Developed new features on a .Net Core plugin-based architecture framework - providing the infrastructure for fast development within the bank's technology ecosystem (e.g., Kafka and Splunk integration).",
        "Restructured accounting reporting application for an insurance policy management system to improve maintainability, extensibility and reliability.",
        "Managed CI/CD pipeline in Azure DevOps and deployment in RedHat OpenShift.",
        "Developed an insurance product builder client with Blazor WebAssembly."
      ]
    },
    {
      "from": "2019-10-01",
      "to": "2020-08-01",
      "title": "Developer",
      "company": "Sitecore",
      "city": "Kuala Lumpur",
      "country": "Malaysia",
      "tags": [ "C#", "JavaScript", "Sitecore" ],
      "details": [
        "Created reusable, configurable and extensible components for Sitecore Commerce Experience Accelerator.",
        "Learned to use Gulp Babel to transpile ES6 JavaScript into ES5 for browser compatibility, and Gulp EsLint for syntax checking.",
        "Improved UI automation tests (C# Selenium) reliability and speed by almost 50%."
      ]
    },
    {
      "from": "2017-02-01",
      "to": "2019-08-01",
      "title": "Senior Web Applications Developer",
      "company": "Sterling RISQ",
      "city": "Subang Jaya",
      "country": "Malaysia",
      "tags": [ "C#", "JavaScript", "Kendo UI" ],
      "details": [
        "Designed and built an ASP.Net MVC 5 background screening application with MSSQL database to replace the legacy application in 9 months.",
        "Developed features including push notifications, file download preview, automatic client time zone conversion, secure encryption in URL and hidden form fields.",
        "Created Razor page helpers to standardize codes for Kendo UI and Metronic Admin component.",
        "Proposed and implemented Editor Mode for Admin users - enabling effortless configuration of text translations.",
        "Designed dynamic questionnaire solution for conditional collection of background screening data.",
        "Automated manual operation processes in the new application.",
        "Integrated Auth0 and Amazon Cognito for SAML SSO login, and Adobe Sign API for e-signing PDF documents.",
        "Led integration project with client's recruitment system for employee preboarding background screening."
      ]
    },
    {
      "from": "2016-05-01",
      "to": "2017-01-01",
      "title": "Application Developer",
      "company": "Teledirect Telecommerce (TDCX)",
      "city": "Kuala Lumpur",
      "country": "Malaysia",
      "tags": [ "C#", "VB.Net", "VB6" ],
      "details": [
        "Developed an ASP.Net MVC 5 customer service system with SSO integration to Knowledge Base and QA system.",
        "Delivered minor enhancements and bug fixes for multiple .Net Framework desktop applications.",
        "Implemented application-level encryption for sensitive information stored in the database.",
        "Developed web services on the Staff Portal, including authentication, to be consumed by other applications."
      ]
    },
    {
      "from": "2015-07-01",
      "to": "2016-04-01",
      "title": "Technical Consultant",
      "company": "atQuest Group",
      "city": "Kuala Lumpur",
      "country": "Malaysia",
      "tags": [ "C#", "ASP.Net MVC 5", "jQuery", "Bootstrap" ],
      "details": [
        "Implemented an algorithm to calculate rendered content sizes in grid layout dynamically.",
        "Designed and developed a WYSIWYG HTML editor for writing articles, similar to Medium.com, with drag-and-drop image uploading and layout picker.",
        "Integrated with Facebook Login and search powered by Microsoft Azure Search."
      ]
    }
  ]
}
